SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26_prs_signals.h
#define PRS_ASYNC_VDAC1L_CH0DONEASYNC                      (PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L | PRS_ASYNC_CH_CTRL_SIGSEL_VDAC1LCH0DONEASYNC)
#define PRS_ASYNC_VDAC1L_REFRESHTIMEROF                    (PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L | PRS_ASYNC_CH_CTRL_SIGSEL_VDAC1LREFRESHTIMEROF)
#define PRS_ASYNC_VDAC1L_INTERNALTIMEROF                   (PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L | PRS_ASYNC_CH_CTRL_SIGSEL_VDAC1LINTERNALTIMEROF)
#define PRS_ASYNC_VDAC1L_CH1DONEASYNC                      (PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L | PRS_ASYNC_CH_CTRL_SIGSEL_VDAC1LCH1DONEASYNC)
#define PRS_ASYNC_TIMER5_UF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5UF)
#define PRS_ASYNC_TIMER5_OF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5OF)
#define PRS_ASYNC_TIMER5_CC0                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5CC0)
#define PRS_ASYNC_TIMER5_CC1                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5CC1)
#define PRS_ASYNC_TIMER5_CC2                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5CC2)
#define PRS_ASYNC_TIMER6_UF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6UF)
#define PRS_ASYNC_TIMER6_OF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6OF)
#define PRS_ASYNC_TIMER6_CC0                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6CC0)
#define PRS_ASYNC_TIMER6_CC1                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6CC1)
#define PRS_ASYNC_TIMER6_CC2                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6CC2)
#define PRS_ASYNC_TIMER7_UF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7UF)
#define PRS_ASYNC_TIMER7_OF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7OF)
#define PRS_ASYNC_TIMER7_CC0                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7CC0)
#define PRS_ASYNC_TIMER7_CC1                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7CC1)
#define PRS_ASYNC_TIMER7_CC2                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7CC2)
#define PRS_ASYNC_TIMER8_UF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER8UF)
#define PRS_ASYNC_TIMER8_OF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER8OF)
#define PRS_ASYNC_TIMER8_CC0                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER8CC0)
#define PRS_ASYNC_TIMER8_CC1                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER8CC1)
#define PRS_ASYNC_TIMER8_CC2                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER8CC2)
#define PRS_ASYNC_TIMER9_UF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER9UF)
#define PRS_ASYNC_TIMER9_OF                                (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER9OF)
#define PRS_ASYNC_TIMER9_CC0                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER9CC0)
#define PRS_ASYNC_TIMER9_CC1                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER9CC1)
#define PRS_ASYNC_TIMER9_CC2                               (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER9CC2)
#define PRS_ASYNC_USART1_CS                                (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1CS)
#define PRS_ASYNC_USART1_IRTX                              (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1IRTX)
#define PRS_ASYNC_USART1_RTS                               (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1RTS)
#define PRS_ASYNC_USART1_RXDATA                            (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1RXDATA)
#define PRS_ASYNC_USART1_TX                                (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1TX)
#define PRS_ASYNC_USART1_TXC                               (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1TXC)
#define PRS_ASYNC_USART2_CS                                (PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 | PRS_ASYNC_CH_CTRL_SIGSEL_USART2CS)
#define PRS_ASYNC_USART2_IRTX                              (PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 | PRS_ASYNC_CH_CTRL_SIGSEL_USART2IRTX)
#define PRS_ASYNC_USART2_RTS                               (PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 | PRS_ASYNC_CH_CTRL_SIGSEL_USART2RTS)
#define PRS_ASYNC_USART2_RXDATA                            (PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 | PRS_ASYNC_CH_CTRL_SIGSEL_USART2RXDATA)
#define PRS_ASYNC_USART2_TX                                (PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 | PRS_ASYNC_CH_CTRL_SIGSEL_USART2TX)
#define PRS_ASYNC_USART2_TXC                               (PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 | PRS_ASYNC_CH_CTRL_SIGSEL_USART2TXC)
#define PRS_ASYNC_EUSART2_CS                               (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2CS)
#define PRS_ASYNC_EUSART2_IRDATX                           (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2IRDATX)
#define PRS_ASYNC_EUSART2_RTS                              (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2RTS)
#define PRS_ASYNC_EUSART2_RXDATAV                          (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2RXDATAV)
#define PRS_ASYNC_EUSART2_RXFL                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2RXFL)
#define PRS_ASYNC_EUSART2_TX                               (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2TX)
#define PRS_ASYNC_EUSART2_TXC                              (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2TXC)
#define PRS_ASYNC_EUSART2_TXFL                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2TXFL)
#define PRS_ASYNC_EUSART3_CS                               (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3CS)
#define PRS_ASYNC_EUSART3_IRDATX                           (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3IRDATX)
#define PRS_ASYNC_EUSART3_RTS                              (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3RTS)
#define PRS_ASYNC_EUSART3_RXDATAV                          (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3RXDATAV)
#define PRS_ASYNC_EUSART3_RXFL                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3RXFL)
#define PRS_ASYNC_EUSART3_TX                               (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3TX)
#define PRS_ASYNC_EUSART3_TXC                              (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3TXC)
#define PRS_ASYNC_EUSART3_TXFL                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3TXFL)
#define PRS_ASYNC_LFRCO_CALMEAS                            (PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO | PRS_ASYNC_CH_CTRL_SIGSEL_LFRCOCALMEAS)
#define PRS_ASYNC_LFRCO_SDM                                (PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO | PRS_ASYNC_CH_CTRL_SIGSEL_LFRCOSDM)
#define PRS_ASYNC_LFRCO_TCMEAS                             (PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO | PRS_ASYNC_CH_CTRL_SIGSEL_LFRCOTCMEAS)

